'''
    y축(특성2)
    10 --------------------------------------
    9 ㅣ                ㅣ          B(8,9)  ㅣ
    8 ㅣ                ㅣ                  ㅣ      
    7 ㅣ          D(4,7)ㅣ                  ㅣ
    6 ㅣ                ㅣ                  ㅣ
    5  -----------------ㅣ-------------------
    4 ㅣ                ㅣ                  ㅣ
    3 ㅣ        A(3,3)  ㅣ            C(9,3)ㅣ   
    2 ㅣ                ㅣ                  ㅣ
    1 ㅣ                ㅣ                  ㅣ
        1   2   3   4   5   6   7   8   9   10  
                                                x축(특성1)
'''

import numpy as np
import pandas as np
